# დაწერეთ პროგრამა, რომლის მეშვეობითაც შეიტანთ წელს და დაადგენთ არის თუ არა
# შეყვანილი რიცხვი ნაკიანი წელიწადი. მაგ: 2012, 2016 წლები ნაკიანია.
# გაითვალისწინეთ, ნაკიანია წელიწადი, რომელიც უნაშთოდ იყოფა ოთხზე, გარდა იმ
# წლებისა რომლებიც იყოფა 100-ზე მაგრამ არ იყოფა 400-ზე. მაგ. 2100, 2200, 2300 წლები
# არ არის ნაკიანი. 2000 წელი ნაკიანია.

year = int(input("Please enter the number: "))

if ( (year % 4) !=0 ):
    print (year,"არ არის ნაკიანი")
elif ( (year % 400) !=0 and (year % 100) == 0 ):
    print (year,"არ არის ნაკიანი")
else:
    print (year,"არის ნაკიანი")